tests/load.yaml
config:
  target: 'https://bxhowxbojc.execute-api.eu-west-1.amazonaws.com/dev'
  phases:
    -
      duration: 40
      arrivalRate: 1
      name: "stage one"

  payload:
    path: "input.csv"
    fields:
      - "id"
      - "email"
      - "number"
    order: "sequence"

scenarios:
  -
    flow:
      -
        put:
          url: "/tokens/{{ id }}"
          json:
            email: "{{ email }}"
            number: "{{ number }}"
      -
        get:
          url: "/tokens/{{ id }}"