tests/load.yaml
config:
  target: 'https://l8cfuwjg0m.execute-api.eu-west-2.amazonaws.com/dev'
  phases:
    -
      duration: 60
      arrivalRate: 2
      name: "2 concurrent"
    -
      pause: 300
    -
      duration: 60
      arrivalRate: 10
      name: "10 concurrent"
    -
      pause: 300
    -
      duration: 60
      arrivalRate: 20
      name: "20 concurrent"
    -
      pause: 300
    -
      duration: 60
      arrivalRate: 30
      name: "25 concurrent"
    -
      pause: 300
    -
      duration: 300
      arrivalRate: 10
      rampTo: 70
      name: "Ramp up from 10 to 70 users/sec"


  payload:
    path: "input.csv"
    fields:
      - "id"
      - "email"
      - "number"
    order: "sequence"

scenarios:
  -
    flow:
      -
        put:
          url: "/tokens/{{ id }}"
          json:
            email: "{{ email }}"
            number: "{{ number }}"
            count: 1
      -
        think: 1
      -
        get:
          url: "/tokens/{{ id }}"
        capture:
          header: "ETag"
          as: etag
      -
        think: 1
      -
        patch:
          url: "/tokens/{{ id }}"
          headers:
            If-Match: "{{ etag }}"
          json:
            count: 2
      -
        think: 1
      -
        get:
          url: "/tokens/{{ id }}"
        capture:
          header: "Etag"
          as: etag
      -
        think: 1
      -
        put:
          url: "/tokens/{{ id }}"
          headers:
            If-Match: "{{ etag }}"
          json:
            email: "{{ email }}"
            number: 101
            count: 3